import React from 'react'
import { Map, Marker, Label } from "react-bmapgl";
import './App.css'

const marks = [{
  label: "凯悦东方公主号海鲜火锅烤肉自助",
  pos: [121.681671, 38.930125]
}, {
  label: "胡同里饭店",
  pos: [121.664899, 38.928978]
}, {
  label: "特别加韩汤锅面",
  pos: [121.667712, 38.926077]
}, {
  label: "大管家腊汁肉夹馍",
  pos: [121.666366, 38.924994]
}, {
  label: "喜粤糖朝",
  pos: [121.662061, 38.924634]
}, {
  label: "酒问半山新派小渔村",
  pos: [121.663568, 38.918164],
}, {
  label: "气象山健身公园",
  pos: [121.663568, 38.918164]
}, {
  label: "南山鲜虾面",
  pos: [121.656572, 38.91982]
}, {
  label: "moto咖啡",
  pos: [121.656572, 38.91982]
}, {
  label: "多多吃货屋",
  pos: [121.658297, 38.923775]
}, {
  label: "Hey蛋包饭",
  pos: [121.652522, 38.921309]
}, {
  label: "壹杯咖啡",
  pos: [121.650371, 38.920067]
}, {
  label: "亚桥咖喱",
  pos: [121.650557, 38.921801]
}, {
  label: "大羊螺蛳粉",
  pos: [121.648727, 38.92001]
}, {
  label: "老美丽咖啡厅",
  pos: [121.647966, 38.920724]
}, {
  label: "撬啤精酿啤酒",
  pos: [121.653077, 38.927649]
}, {
  label: "四季肠粉",
  pos: [121.653077, 38.927649]
}, {
  label: "丰茂盛朝鲜族烤串",
  pos: [121.653816, 38.93313]
}, {
  label: "大连美术馆",
  pos: [121.644199, 38.933139]
}, {
  label: "糯米香",
  pos: [121.643029, 38.927852]
}, {
  label: "水城印象",
  pos: [121.643029, 38.927852]
}, {
  label: "月升咖啡馆",
  pos: [121.643029, 38.927852]
}, {
  label: "老张豆腐串焖子",
  pos: [121.643029, 38.927852]
}, {
  label: "2路麻辣烫",
  pos: [121.642277, 38.923574]
}, {
  label: "喜满堂",
  pos: [121.635639, 38.92361]
}, {
  label: "一人食堂",
  pos: [121.635146, 38.919811]
}, {
  label: "鳗家日本料理",
  pos: [121.634486, 38.919841]
}, {
  label: "老罐羊汤",
  pos: [121.629272, 38.915875]
}, {
  label: "东关街",
  pos: [119.455731, 32.403514]
}, {
  label: "TinyGreatTaproom",
  pos: [121.621301, 38.920965]
}, {
  label: "古丽烧烤",
  pos: [121.621301, 38.920965]
}, {
  label: "华鲀酒店",
  pos: [121.613594, 38.917325]
}, {
  label: "蟹将军",
  pos: [121.615807, 38.911795]
}, {
  label: "方城小吃",
  pos: [121.60385, 38.90723]
}, {
  label: "大连图书馆",
  pos: [121.620441, 38.905249]
}, {
  label: "汉巴味德",
  pos: [121.617657, 38.937818]
}, {
  label: "羽田先生小食屋",
  pos: [121.596765, 38.929651]
}, {
  label: "本味匠心",
  pos: [121.596444, 38.917983]
}, {
  label: "神乐屋",
  pos: [110.776263, 32.657401]
}, {
  label: "哈尔滨老福盛砂锅",
  pos: [110.776263, 32.657401]
}, {
  label: "杰小生",
  pos: [121.590408, 38.920797]
}, {
  label: "千太郎拉面",
  pos: [121.591669, 38.919588]
}, {
  label: "王记港式地摊打边炉",
  pos: [121.591785, 38.91786]
}, {
  label: "辽b小串",
  pos: [121.59095, 38.918253]
}, {
  label: "王漾新和食",
  pos: [121.587149, 38.917506]
}, {
  label: "牛太无二日式和牛火锅自助",
  pos: [121.595582, 38.903504]
}, {
  label: "钱库里海鲜自助",
  pos: [121.599485, 38.889364]
}, {
  label: "作物合集",
  pos: [121.577999, 38.919493]
}, {
  label: "胜哥海鲜烤肉",
  pos: [121.576587, 38.920402]
}, {
  label: "马兰锅贴",
  pos: [121.559285, 38.925322]
}, {
  label: "胖姐麻辣拌",
  pos: [121.54656, 38.957461]
}, {
  label: "韩玉饭店",
  pos: [121.554595, 38.965299]
}, {
  label: "刘文祥大碗麻辣烫",
  pos: [121.557477, 38.976581]
}, {
  label: "国庆烧麦",
  pos: [121.543959, 38.975033]
}, {
  label: "大连汉墓博物馆",
  pos: [121.422071, 39.0027]
}, {
  label: "神龙仙岛",
  pos: [121.100492, 38.911284]
}, {
  label: "旅顺工科大校长旧居",
  pos: [121.237415, 38.818541]
}, {
  label: "鲸川馆",
  pos: [121.238853, 38.816095]
}, {
  label: "旅顺博物馆",
  pos: [121.241609, 38.814166]
}, {
  label: "旅顺火车站",
  pos: [121.259124, 38.813419]
}, {
  label: "金海明珠海鲜舫",
  pos: [121.788496, 39.034478]
}, {
  label: "花屋炸串",
  pos: [121.772298, 39.05099]
}, {
  label: "豆满江",
  pos: [121.770355, 39.048347]
}, {
  label: "长春特色砂锅麻辣烫",
  pos: [121.758725, 39.050922]
}, {
  label: "椒王老式麻辣烫",
  pos: [121.723298, 39.114821]
}];


function App() {
  return (
    <div className="App" id="App">
      <Map center={{ lng: 121.605868, lat: 39.004631 }} zoom={11} enableScrollWheelZoom={true} enableDoubleClickZoom={true} style={{ height: "100%" }}>
        {marks.map(({ label, pos }) => (
          <>
            <Marker position={new BMapGL.Point(...pos)} ></Marker>
            <Label text={label} position={new BMapGL.Point(...pos)}></Label>
          </>
        ))}
      </Map>
    </div >
  )
}

export default App
